cases/electrochemicalFoam/1mm_1D/0.org/C_ZnOH4--
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object 	    C_ZnOH4--;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 200;

boundaryField
{
    topAndBottom 
    {
        type            empty;
    }
    
    currentCollector 
    {
        type            calculatedGradient;
        value           uniform 0;
    }    

    separator
    {
        type            fixedValue;
        value           uniform 200;
        //type            calculatedGradient;
        //value           uniform 0;
    }    

    frontAndBack 
    {
        type            empty;
    }

//    wall 
//    {
//        type            zeroGradient;
//        //type            calculatedGradient;
//        //value           uniform 0;
//    }    
}

// ************************************************************************* //
