cases/electrochemicalFoam/1mm_1D/0.org/kappa_2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      kappa_1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [-1 -3 3 0 0 2 0];

internalField   nonuniform List<scalar> 10(95 95.5 96 96.5 97 97.5 98 98.5 99 99.5);

boundaryField
{
    topAndBottom
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
    currentCollector
    {
        type            calculated;
        value           uniform 94.75;
    }
    separator
    {
        type            calculated;
        value           uniform 99.75;
    }
}


// ************************************************************************* //
