cases/electrochemicalFoam/1mm_1D/0.org/rho
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1290.0;

boundaryField
{
    topAndBottom 
    {
        type            empty;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    
    currentCollector
    {
        type            zeroGradient;
    }

    separator
    {
        type            zeroGradient;
    }    
 
    frontAndBack 
    {
        type            empty;
    }

    wall 
    {
        type            zeroGradient;
    }    
}


// ************************************************************************* //
