cases/electrochemicalFoam/1mm_1D/constant/restartRun/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings

modelType "A"; // A or B

couplingInterval 1;

voidFractionModel divided;//centre;//

locateModel engine;//standard;//turboEngineM2M;//

meshMotionModel noMeshMotion;

regionModel allRegion;

IOModel "basicIO";

probeModel off;

dataExchangeModel twoWayMPI;//twoWayM2M;//twoWayFiles;//oneWayVTK;//

averagingModel dense; //dilute; //

clockModel off;//standardClock;//

smoothingModel constDiffSmoothing; //localPSizeDiffSmoothing;//constDiffSmoothing;//  

forceModels
(
    //GidaspowDrag
    //DiFeliceDrag
    //KawaseUlbrecht
    //KochHillDrag
    gradPForce
    viscForce
    //Archimedes
    ChristopherMiddleman
    //volWeightedAverage
    //totalMomentumExchange
);

momCoupleModels
(
    implicitCouple
);

turbulenceModelType "RASProperties";//"LESProperties";//

//===========================================================================//
// sub-model properties

implicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}

ArchimedesProps
{
    gravityFieldName "g";
}
gradPForceProps
{
    pFieldName "p";
    voidfractionFieldName "voidfraction";
    velocityFieldName "U";
    interpolation true;
}

viscForceProps
{
    velocityFieldName "U";
    interpolation true;
}
volWeightedAverageProps
{
    scalarFieldNames
    (
        voidfraction
    );
    vectorFieldNames
    (
    );
    upperThreshold 0.999;
    lowerThreshold 0;
    //verbose;
}
totalMomentumExchangeProps
{
    implicitMomExFieldName "Ksl";
    explicitMomExFieldName "none";
    fluidVelFieldName "U";
    granVelFieldName "Us";
}
GidaspowDragProps
{
    velFieldName "U";
    densityFieldName "rho";
    phi 1;
}
DEMbasedDragProps
{
    velFieldName "U";
    voidfractionFieldName "voidfraction";
}

DiFeliceDragProps
{
    //verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    granVelFieldName "Us";
    interpolation true;
}

KochHillDragProps
{
    //verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    interpolation true;
    //forceSubModels
    //(
    //    ImExCorr
    //);
    implForceDEM true;
    //implForceDEMaccumulated true;
    //explicitCorr true;
}

KawaseUlbrechtProps
{
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    n 1;// powerlawFieldName "n"; //the n values are read as powerlawFieldName
    consistencyFieldName "m"; //m 0.01;// consistencyFieldName "m"; //the consistency index m is defined 
    interpolation true;
    implForceDEM true;
}
ChristopherMiddlemanProps
{
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    n 0.536;// powerlawFieldName "n"; //the n values are read as powerlawFieldName
    consistencyFieldName "m"; //m 0.01;// consistencyFieldName "m"; //the consistency index m is defined 
    interpolation true;
    implForceDEM true;
}
BeetstraDragProps
{
    velFieldName "U";
    gravityFieldName "g";
    rhoParticle     2000.;
    voidfractionFieldName "voidfraction";
    interpolation ;
    useFilteredDragModel ;
    useParcelSizeDependentFilteredDrag ;
    k       0.05;
    aLimit  0.0;
//    verbose true;
}

RongDragProps
{
    verbose true;
    velFieldName "U";
    voidfractionFieldName "voidfraction";
    interpolation true;
    implForceDEM true;
    implForceDEMaccumulated true;
    granVelFieldName "Us";
}

virtualMassForceProps
{
    velFieldName "U";
}

particleCellVolumeProps
{
    upperThreshold 0.999;
    lowerThreshold 0.;
    verbose true;
}

fieldStoreProps
{
    scalarFieldNames
    (
    );

    vectorFieldNames
    (
        "U"
    );
}


oneWayVTKProps
{
    couplingFilename "vtk_out%4.4d.vtk";
    maxNumberOfParticles 30000;
}

twoWayFilesProps
{
    maxNumberOfParticles 10000;
    DEMts 0.00003;
}

centreProps
{
    alphaMin 0.30;//0.10;
}

engineProps
{
    treeSearch true;
}


turboEngineM2MProps
{
    turboEngineProps
    {
        treeSearch true;
    }
}

dividedProps
{
    alphaMin 0.1;
    scaleUpVol 1.0;
}

twoWayMPIProps
{
    maxNumberOfParticles 50000;
    liggghtsPath "../DEM/in.liggghts_restart";
}

twoWayM2MProps
{
    maxNumberOfParticles 10100;
    liggghtsPath "../DEM/in.liggghts_resume";
}

constDiffSmoothingProps
{
    lowerLimit 0.0;
    upperLimit 1e10;
    smoothingLength 0.0002;
    //smoothingLengthReferenceField 1.0;
}
localPSizeDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    dSmoothingLength 0.0001;
    Csmoothing    1.0; 
}
// ************************************************************************* //
